input: "data"
input_shape {
  dim: 1
  dim: 10
}
layer {
  name: "caffe.InnerProduct_0"
  type: "InnerProduct"
  bottom: "data"
  top: "caffe.InnerProduct_0"
  inner_product_param {
    num_output: 2
  }
}
